NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_client.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "config_client.h"
#include "config_opcodes.h"
#include "config_messages.h"

#include <stdint.h>

#include "composition_data.h"

#include "access.h"
#include "access_config.h"
#include "access_reliable.h"
#include "device_state_manager.h"

#include "nrf_mesh_assert.h"
#include "packet_mgr.h"

#define MAKE_BYTE_MASK(bits) (0xff >> (8u - bits))
#define CONFIG_PUBLISH_PERIOD(steps, resolution) \
    ((resolution & MAKE_BYTE_MASK(ACCESS_PUBLISH_STEP_RES_BITS)) << ACCESS_PUBLISH_STEP_NUM_BITS \
        | (steps & MAKE_BYTE_MASK(ACCESS_PUBLISH_STEP_NUM_BITS)))

/*****************************************************************************
 * Definitions
 *****************************************************************************/

#define CONFIG_CLIENT_MODEL_ID (0x0001)

#define PAYLOAD_LENGTH_MAX (NRF_MESH_SEG_PAYLOAD_SIZE_MAX)

#define IS_SIG_MODEL(model_id)                          \
    (model_id.company_id == ACCESS_COMPANY_ID_NONE)

/**
 * Calculates the size of a packet depending on whether it is a SIG model or not.
 */
#define PACKET_LENGTH_WITH_ID(packet_type, sig_model)                   \
    (sizeof(packet_type) - ((sig_model) ? sizeof(uint16_t) : 0))

typedef enum
{
    CONFIG_CLIENT_STATE_NONE,
    CONFIG_CLIENT_STATE_IDLE,
    CONFIG_CLIENT_STATE_WAIT_REPLY
} config_client_state_t;

typedef struct
{
    access_model_handle_t model_handle;
    config_client_state_t state;
    config_client_event_cb_t event_cb;
} config_client_t;

typedef struct
{
    config_opcode_t opcode;
    uint16_t payload_length_min;
    uint16_t payload_length_max;
} config_message_lut_t;

/*****************************************************************************
 * Static data
 *****************************************************************************/

static config_client_t m_client;
static uint8_t * mp_packet_buffer;

/*****************************************************************************
 * Static functions
 *****************************************************************************/
static void config_opcode_handler(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args);

static void reliable_status_cb(access_model_handle_t model_handle, void * p_args, access_reliable_status_t status)
{
    /* Some messages does not carry data, s.t. no packet is allocated for it. E.g., netkey_get(). */
    if (mp_packet_buffer != NULL)
    {
        packet_mgr_free(mp_packet_buffer);
        mp_packet_buffer = NULL;
    }

    m_client.state = CONFIG_CLIENT_STATE_IDLE;

    switch (status)
    {
        case ACCESS_RELIABLE_TRANSFER_SUCCESS:
            /* Ignore */
            break;
        case ACCESS_RELIABLE_TRANSFER_TIMEOUT:
            m_client.event_cb(CONFIG_CLIENT_EVENT_TYPE_TIMEOUT, NULL, 0);
            break;
        case ACCESS_RELIABLE_TRANSFER_CANCELLED:
            m_client.event_cb(CONFIG_CLIENT_EVENT_TYPE_CANCELLED, NULL, 0);
            break;
        default:
            NRF_MESH_ASSERT(false);
            break;
    }
}

static uint32_t send_reliable(config_opcode_t opcode, uint16_t length, config_opcode_t reply_opcode)
{
    access_reliable_t reliable;
    reliable.model_handle = m_client.model_handle;
    reliable.message.p_buffer = mp_packet_buffer;
    reliable.message.length = length;
    reliable.message.opcode.opcode = opcode;
    reliable.message.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reliable.message.force_segmented = false;
    reliable.message.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;
    reliable.message.access_token = nrf_mesh_unique_token_get();
    reliable.reply_opcode.opcode = reply_opcode;
    reliable.reply_opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reliable.timeout = CONFIG_CLIENT_ACKED_TRANSACTION_TIMEOUT;
    reliable.status_cb = reliable_status_cb;

    uint32_t status = access_model_reliable_publish(&reliable);
    if (status != NRF_SUCCESS)
    {
        packet_mgr_free(mp_packet_buffer);
        mp_packet_buffer = NULL;
    }
    else
    {
        m_client.state = CONFIG_CLIENT_STATE_WAIT_REPLY;
    }
    return status;
}

/*****************************************************************************
 * Opcode handlers
 *****************************************************************************/

static const config_message_lut_t m_config_message_lut[] =
{
    {CONFIG_OPCODE_COMPOSITION_DATA_STATUS,       COMPOSITION_DATA_LENGTH_MIN,                                   PAYLOAD_LENGTH_MAX},
    {CONFIG_OPCODE_APPKEY_STATUS,                 sizeof(config_msg_appkey_status_t),                            sizeof(config_msg_appkey_status_t)},
    {CONFIG_OPCODE_APPKEY_LIST,                   sizeof(config_msg_appkey_list_t),                              PAYLOAD_LENGTH_MAX},
    {CONFIG_OPCODE_BEACON_STATUS,                 sizeof(config_msg_net_beacon_status_t),                        sizeof(config_msg_net_beacon_status_t)},
    {CONFIG_OPCODE_DEFAULT_TTL_STATUS,            sizeof(config_msg_default_ttl_status_t),                       sizeof(config_msg_default_ttl_status_t)},
    {CONFIG_OPCODE_MODEL_APP_STATUS,              PACKET_LENGTH_WITH_ID(config_msg_app_status_t, true),          PACKET_LENGTH_WITH_ID(config_msg_app_status_t, false)},
    {CONFIG_OPCODE_MODEL_PUBLICATION_STATUS,      PACKET_LENGTH_WITH_ID(config_msg_publication_status_t, true),  PACKET_LENGTH_WITH_ID(config_msg_publication_status_t, false)},
    {CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS,     PACKET_LENGTH_WITH_ID(config_msg_subscription_status_t, true), PACKET_LENGTH_WITH_ID(config_msg_subscription_status_t, false)},
    {CONFIG_OPCODE_NETKEY_STATUS,                 sizeof(config_msg_netkey_status_t),                            sizeof(config_msg_netkey_status_t)},
    {CONFIG_OPCODE_NETKEY_LIST,                   0,                                                             PAYLOAD_LENGTH_MAX},
    {CONFIG_OPCODE_NODE_RESET_STATUS,             0,                                                             0},
    {CONFIG_OPCODE_RELAY_STATUS,                  sizeof(config_msg_relay_status_t),                             sizeof(config_msg_relay_status_t)},
    {CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS,      sizeof(config_msg_key_refresh_phase_status_t),                 sizeof(config_msg_key_refresh_phase_status_t)},
    {CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS,  sizeof(config_msg_heartbeat_publication_status_t),             sizeof(config_msg_heartbeat_publication_status_t)},
    {CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_STATUS, sizeof(config_msg_heartbeat_subscription_status_t),            sizeof(config_msg_heartbeat_subscription_status_t)},
};

static const access_opcode_handler_t m_opcode_handlers[] =
{
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_COMPOSITION_DATA_STATUS),       config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_APPKEY_STATUS),                 config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_APPKEY_LIST),                   config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_BEACON_STATUS),                 config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_DEFAULT_TTL_STATUS),            config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_APP_STATUS),              config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS),      config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS),     config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETKEY_STATUS),                 config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETKEY_LIST),                   config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NODE_RESET_STATUS),             config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_RELAY_STATUS),                  config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS),      config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS),  config_opcode_handler },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_STATUS), config_opcode_handler },
};

/* Ensure that the two tables are the same size. */
NRF_MESH_STATIC_ASSERT((sizeof(m_opcode_handlers)/sizeof(m_opcode_handlers[0]) ==
                        sizeof(m_config_message_lut)/sizeof(m_config_message_lut[0])));


