NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_client.c
}

uint32_t config_client_server_bind(dsm_handle_t server_devkey_handle)
{
    uint32_t status = NRF_SUCCESS;
    if (!client_in_wrong_state(&status))
    {
        status = access_model_application_bind(m_client.model_handle, server_devkey_handle);
        if (status == NRF_SUCCESS)
        {
            access_flash_config_store();
        }
    }

    return status;
}

uint32_t config_client_composition_data_get(uint8_t page_number)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_composition_data_get_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_composition_data_get_t * p_msg = (config_msg_composition_data_get_t *) mp_packet_buffer;
    p_msg->page_number = page_number;

    return send_reliable(CONFIG_OPCODE_COMPOSITION_DATA_GET, length, CONFIG_OPCODE_COMPOSITION_DATA_STATUS);
}

uint32_t config_client_appkey_add(uint16_t netkey_index, uint16_t appkey_index, const uint8_t * p_appkey)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(p_appkey != NULL);
    NRF_MESH_ASSERT(mp_packet_buffer == NULL);

    uint16_t length = sizeof(config_msg_appkey_add_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_appkey_add_t * p_msg = (config_msg_appkey_add_t *) mp_packet_buffer;
    config_msg_key_index_24_set(&p_msg->key_indexes, netkey_index, appkey_index);
    memcpy(&p_msg->appkey[0], &p_appkey[0], NRF_MESH_KEY_SIZE);

    return send_reliable(CONFIG_OPCODE_APPKEY_ADD, length, CONFIG_OPCODE_APPKEY_STATUS);
}

uint32_t config_client_appkey_delete(uint16_t netkey_index, uint16_t appkey_index)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_appkey_delete_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_appkey_delete_t * p_msg = (config_msg_appkey_delete_t *) mp_packet_buffer;
    config_msg_key_index_24_set(&p_msg->key_indexes, netkey_index, appkey_index);

    return send_reliable(CONFIG_OPCODE_APPKEY_DELETE, length, CONFIG_OPCODE_APPKEY_STATUS);
}

uint32_t config_client_appkey_get(uint16_t netkey_index)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_appkey_get_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_appkey_get_t * p_msg = (config_msg_appkey_get_t *) mp_packet_buffer;
    p_msg->netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;

    return send_reliable(CONFIG_OPCODE_APPKEY_GET, length, CONFIG_OPCODE_APPKEY_LIST);
}

uint32_t config_client_appkey_update(uint16_t netkey_index, uint16_t appkey_index, const uint8_t * p_appkey)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_appkey_update_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_appkey_update_t * p_msg = (config_msg_appkey_update_t *) mp_packet_buffer;
    config_msg_key_index_24_set(&p_msg->key_indexes, netkey_index, appkey_index);
    memcpy(&p_msg->appkey[0], &p_appkey[0], NRF_MESH_KEY_SIZE);

    return send_reliable(CONFIG_OPCODE_APPKEY_UPDATE, length, CONFIG_OPCODE_APPKEY_STATUS);
}

uint32_t config_client_model_publication_get(uint16_t element_address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_publication_get_t, sig_model);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_publication_get_t * p_msg = (config_msg_publication_get_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    config_msg_model_id_set(&p_msg->model_id, &model_id, sig_model);

    return send_reliable(CONFIG_OPCODE_MODEL_PUBLICATION_GET, length, CONFIG_OPCODE_MODEL_PUBLICATION_STATUS);
}

uint32_t config_client_model_publication_set(const config_publication_state_t * p_publication_state)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (p_publication_state == NULL)
    {
        return NRF_ERROR_NULL;
    }
    else if (p_publication_state->publish_address.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        return publication_virtual_set(p_publication_state);
    }
    else
    {
        return publication_set(p_publication_state);
    }
}

uint32_t config_client_net_beacon_get(void)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    return send_reliable(CONFIG_OPCODE_BEACON_GET, 0, CONFIG_OPCODE_BEACON_STATUS);
}

uint32_t config_client_net_beacon_set(config_net_beacon_state_t state)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_net_beacon_set_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_net_beacon_set_t * p_msg = (config_msg_net_beacon_set_t *) mp_packet_buffer;
    p_msg->beacon_state = state;

    return send_reliable(CONFIG_OPCODE_BEACON_SET, length, CONFIG_OPCODE_BEACON_STATUS);
}

uint32_t config_client_default_ttl_get(void)
{
    return send_reliable(CONFIG_OPCODE_DEFAULT_TTL_GET, 0, CONFIG_OPCODE_DEFAULT_TTL_STATUS);
}

uint32_t config_client_default_ttl_set(uint8_t ttl)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (ttl > NRF_MESH_TTL_MAX)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);

    uint16_t length = sizeof(config_msg_default_ttl_set_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_default_ttl_set_t * p_msg = (config_msg_default_ttl_set_t *) mp_packet_buffer;
    p_msg->ttl = ttl;

