NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_client.c
    return send_reliable(CONFIG_OPCODE_NETKEY_DELETE, length, CONFIG_OPCODE_NETKEY_STATUS);
}

uint32_t config_client_netkey_get(void)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    return send_reliable(CONFIG_OPCODE_NETKEY_GET, 0, CONFIG_OPCODE_NETKEY_LIST);
}

uint32_t config_client_netkey_update(uint16_t netkey_index, const uint8_t * p_netkey)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_netkey_add_update_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_netkey_add_update_t * p_msg = (config_msg_netkey_add_update_t *) mp_packet_buffer;
    p_msg->netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;
    memcpy(p_msg->netkey, p_netkey, NRF_MESH_KEY_SIZE);

    return send_reliable(CONFIG_OPCODE_NETKEY_UPDATE, length, CONFIG_OPCODE_NETKEY_STATUS);
}

uint32_t config_client_node_reset(void)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    return send_reliable(CONFIG_OPCODE_NODE_RESET, 0, CONFIG_OPCODE_NODE_RESET_STATUS);
}

uint32_t config_client_key_refresh_phase_get(uint16_t netkey_index)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_key_refresh_phase_get_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_key_refresh_phase_get_t * p_msg = (config_msg_key_refresh_phase_get_t *) mp_packet_buffer;
    p_msg->netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;
    return send_reliable(CONFIG_OPCODE_KEY_REFRESH_PHASE_GET, length, CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS);
}

uint32_t config_client_key_refresh_phase_set(uint16_t netkey_index, nrf_mesh_key_refresh_phase_t phase)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_key_refresh_phase_set_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_key_refresh_phase_set_t * p_msg = (config_msg_key_refresh_phase_set_t *) mp_packet_buffer;
    p_msg->netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;
    p_msg->transition = (uint8_t) phase;
    return send_reliable(CONFIG_OPCODE_KEY_REFRESH_PHASE_SET, length, CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS);
}

uint32_t config_client_friend_get(void)
{
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t config_client_friend_set(bool state)
{
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t config_client_gatt_proxy_get(void)
{
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t config_client_gatt_proxy_set(bool state)
{
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t config_client_node_identity_get(uint16_t netkey_index)
{
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t config_client_node_identity_set(uint16_t netkey_index, config_identity_state_t state)
{
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t config_client_heartbeat_publication_get(void)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    return send_reliable(CONFIG_OPCODE_HEARTBEAT_PUBLICATION_GET, 0, CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS);
}

uint32_t config_client_heartbeat_publication_set(const config_msg_heartbeat_publication_set_t * p_publication)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_heartbeat_publication_set_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_heartbeat_publication_set_t * p_msg = (config_msg_heartbeat_publication_set_t *) mp_packet_buffer;
    *p_msg = *p_publication;
    return send_reliable(CONFIG_OPCODE_HEARTBEAT_PUBLICATION_SET, length, CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS);
}

uint32_t config_client_heartbeat_subscription_get(void)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    return send_reliable(CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_GET, 0, CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_STATUS);
}

uint32_t config_client_heartbeat_subscription_set(const config_msg_heartbeat_subscription_set_t * p_subscription)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_heartbeat_subscription_set_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_heartbeat_subscription_set_t * p_msg = (config_msg_heartbeat_subscription_set_t *) mp_packet_buffer;
    *p_msg = *p_subscription;

    return send_reliable(CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_SET, length, CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_STATUS);
}

void config_client_pending_msg_cancel(void)
{
    (void)access_model_reliable_cancel(m_client.model_handle);
}

#if defined(UNIT_TEST)
void config_client_reset(void)
{
    memset(&m_client, 0, sizeof(m_client));
}
#endif
